app/views/generos/index.html.erb

SELECT "jogos".* FROM "jogos" INNER JOIN "jogos_generos" ON "jogos"."id" = "jogos_generos"."jogo_id" WHERE "jogos_generos"."genero_id" = ?  [["genero_id", 1]]
---
        <td><%= genero.nome %></td>
 	<% cont = genero.jogos.length-1 %>