app/views/generos/show.html.erb

<strong>Jogos:</strong>
<% @genero.jogos.each do |jogo| %>
---
SELECT "jogos".* FROM "jogos" INNER JOIN "jogos_generos" ON "jogos"."id" = "jogos_generos"."jogo_id" WHERE "jogos_generos"."genero_id" = ?  [["genero_id", 1]]