Speedfy/app/controllers/jogadas_controller.rb

  def index
    @jogadas = Jogada.all
---
SELECT "jogadas".* FROM "jogadas"

  def create
    @jogada = Jogada.new(jogada_params)

    respond_to do |format|
      if @jogada.save
---
INSERT INTO "jogadas" ("plataforma", "data", "link", "jogador", "jogo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @jogada.destroy
---
DELETE FROM "jogadas" WHERE "jogadas"."id" = ?  [["id", 980190962]]

    def set_jogada
      @jogada = Jogada.find(params[:id])
---
SELECT  "jogadas".* FROM "jogadas" WHERE "jogadas"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]