Speedfy/app/controllers/jogos_controller.rb

  def index
    @jogos = Jogo.all
---
SELECT "jogos".* FROM "jogos"

  def create
    @jogo = Jogo.new(jogo_params)

    respond_to do |format|
      if @jogo.save
---
INSERT INTO "jogos" ("titulo", "genero", "imagem", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "MyString"], ["genero", "MyString"], ["imagem", "MyString"], ["created_at", "2017-09-08 01:14:59.507769"], ["updated_at", "2017-09-08 01:14:59.507769"]]

  def destroy
    @jogo.destroy
---
DELETE FROM "jogos" WHERE "jogos"."id" = ?  [["id", 980190962]]

    def set_jogo
      @jogo = Jogo.find(params[:id])
---
SELECT  "jogos".* FROM "jogos" WHERE "jogos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]