app/views/amigos/index.html.erb

      <tr>
        <td><%= Usuario.find(amigo.usuario_id).username %></td>
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]