app/views/jogadas/_form.html.erb

     <%= form.label :jogo_id %>
     <%= form.collection_select :jogo_id, Jogo.order(:titulo),:id,:titulo, include_blank: false %>
---
SELECT  "jogos".* FROM "jogos" WHERE (LOWER(titulo) = 'aya shimemaru') LIMIT ?  [["LIMIT", 1]]