app/views/jogos/_form.html.erb

SELECT  1 AS one FROM "generos" INNER JOIN "jogos_generos" ON "generos"."id" = "jogos_generos"."genero_id" WHERE "jogos_generos"."jogo_id" = ? AND "generos"."id" = ? LIMIT ?  [["jogo_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "generos".* FROM "generos"
---
    <% @generos.each do |genero| %>
    	<%= check_box_tag 'genero_ids[]', genero.id, jogo.generos.include?(genero) %>