app/views/jogos/buscar_nome.html.erb

	<td>
	   <% cont = jogo.generos.length-1 %>
---
SELECT "generos".* FROM "generos" INNER JOIN "jogos_generos" ON "generos"."id" = "jogos_generos"."genero_id" WHERE "jogos_generos"."jogo_id" = ?  [["jogo_id", 1]]