app/views/jogos/show.html.erb

SELECT "generos".* FROM "generos" INNER JOIN "jogos_generos" ON "generos"."id" = "jogos_generos"."genero_id" WHERE "jogos_generos"."jogo_id" = ?  [["jogo_id", 1]]
---
  <strong>Gêneros:</strong>
  <% cont = @jogo.generos.length-1 %>