app/views/usuarios/index.html.erb

        <td><%= usuario.username %></td>
        <td><%= usuario.jogadas.count %></td>
---
SELECT COUNT(*) FROM "jogadas" WHERE "jogadas"."usuario_id" = ?  [["usuario_id", 2]]