app/views/usuarios/show.html.erb

  <strong>Número de jogadas:</strong>
  <%= @usuario.jogadas.count %>
---
SELECT "jogadas".* FROM "jogadas" WHERE "jogadas"."usuario_id" = ?  [["usuario_id", 3]]
SELECT COUNT(*) FROM "jogadas" WHERE "jogadas"."usuario_id" = ?  [["usuario_id", 2]]

  <% if current_user.id != @usuario.id %>
	  <% if !current_user.amigos.include?(@usuario)%>
---
SELECT "amigos".* FROM "amigos" WHERE "amigos"."amigo_id" = ? ORDER BY username asc  [["amigo_id", 3]]

<h1>Ultimas jogadas adicionadas</h1>
<% @usuario.jogadas.order("created_at desc").first(5).each do |jogada| %>
---
SELECT  "jogadas".* FROM "jogadas" WHERE "jogadas"."usuario_id" = ? ORDER BY created_at cresc LIMIT ?  [["usuario_id", 3], ["LIMIT", 5]]


<% jogos_mais_jogados(@usuario.jogadas).first(5).each do |jogo,count| %>
---
SELECT  "jogadas".* FROM "jogadas" WHERE "jogadas"."usuario_id" = ? ORDER BY "jogadas"."id" ASC LIMIT ?  [["usuario_id", 3], ["LIMIT", 5]]