app/controllers/amigos_controller.rb

  def index
    @amigos = Amigo.all
---
SELECT "amigos".* FROM "amigos"

  def create
    @amigo = Amigo.new(amigo_params)

    respond_to do |format|
      if @amigo.save
---
INSERT INTO "amigos" ("usuarioId", "amigoId", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["usuarioId", "MyString"], ["amigoId", "MyString"], ["created_at", "2017-09-06 01:02:56.818452"], ["updated_at", "2017-09-06 01:02:56.818452"]]

  def destroy
    @amigo.destroy
---
DELETE FROM "amigos" WHERE "amigos"."id" = ?  [["id", 980190962]]

  def deletar
     @amigo = Amigo.find_by(amigo_params)
     @amigo.destroy
---
SELECT "amigos".* FROM "amigos" WHERE (amigo_id = 3)
DELETE FROM "amigos" WHERE "amigos"."id" = ?  [["id", 23]]

    def set_amigo
      @amigo = Amigo.find(params[:id])
---
SELECT  "amigos".* FROM "amigos" WHERE "amigos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]