app/controllers/comentarios_controller.rb

INSERT INTO "comentarios" ("jogada_id", "comentario", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["jogada_id", 1], ["comentario", "aaaaa"], ["created_at", "2017-10-07 19:19:45.411916"], ["updated_at", "2017-10-07 19:19:45.411916"]]
---
  def create
    @comentario = Comentario.new(jogada_id:params[:jogada_id],comentario:params[:comentario])
    if @comentario.save