app/controllers/index_controller.rb

  def home
  @jogadas = Jogada.order('data DESC').limit(10)
  @jogada = Jogada.new
  @jogos = Jogo.all
---
SELECT  "jogadas".* FROM "jogadas" ORDER BY data ASC, created_at desc LIMIT ?  [["LIMIT", 10]]
SELECT "jogos".* FROM "jogos"