app/controllers/jogadas_controller.rb

SELECT "jogadas".* FROM "jogadas" ORDER BY milissegundos
---
  def index
    @jogadas = Jogada.order('milissegundos')

SELECT "comentarios".* FROM "comentarios" WHERE (jogada_id EQUALS 1)
---
  def show
    idJogada = @jogada.id
    @comentarios = Comentario.where(["jogada_id = ?", idJogada])

SELECT  "jogos".* FROM "jogos" WHERE (LOWER(titulo) = 'mario') LIMIT ?  [["LIMIT", 1]]
---
  def create
    @jogada = Jogada.new(jogada_params)

    respond_to do |format|
      if @jogada.salvar(jogada_params)
        format.html { redirect_to @jogada, notice: 'Jogada was successfully created.' }
        format.json { render :show, status: :created, location: @jogada }
      else
        format.html { redirect_to home_path(id: @jogada.jogo_id), flash: { error: @jogada.errors.full_messages.join(', ')}}

SELECT  "jogos".* FROM "jogos" WHERE (LOWER(titulo) = '1') LIMIT ?  [["LIMIT", 1]]
---
  def add_pelo_jogo

      @jogada = Jogada.new(jogada_params)
      respond_to do |format|
      if @jogada.salvar(jogada_params)
        format.html { redirect_to @jogada, notice: 'Jogada was successfully created.' }
 	format.json { head :no_content }
      else
        format.html { redirect_to jogoAddJogada_path(id: @jogada.jogo_id), flash: { error: @jogada.errors.full_messages.join(', ')}}

DELETE FROM "jogadas" WHERE "jogadas"."id" = ?  [["id", 3]]
---
  def destroy
    @jogada.destroy

SELECT  "jogadas".* FROM "jogadas" WHERE "jogadas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_jogada
      @jogada = Jogada.find(params[:id])