app/controllers/jogos_controller.rb

SELECT "jogos".* FROM "jogos"
---
  def index
    @jogos = Jogo.all

SELECT "generos".* FROM "generos"
---
  def new
    @jogo = Jogo.new
    @generos = Genero.all

SELECT "generos".* FROM "generos"
---
  def edit
    @generos = Genero.all

SELECT "generos".* FROM "generos"
---
  def create
    @jogo = Jogo.new(jogo_params)
    generos = params[:genero_ids]
    respond_to do |format|
      if @jogo.salvar (generos)
        format.html { redirect_to @jogo, notice: 'Jogo foi criado com sucesso.' }
        format.json { render :show, status: :created, location: @jogo }
      else
        format.html { render :new }
	@generos = Genero.all

SELECT "generos".* FROM "generos"
---
  def update
    generos = params[:genero_ids]
    respond_to do |format|
      if @jogo.atualizar(jogo_params,generos)
        format.html { redirect_to @jogo, notice: 'Jogo foi atualizado com sucesso.' }
        format.json { render :show, status: :ok, location: @jogo }
      else
        format.html { render :edit }
	@generos = Genero.all

DELETE FROM "jogos" WHERE "jogos"."id" = ?  [["id", 4]]
---
  def destroy
    @jogo.destroy

SELECT "jogos".* FROM "jogos" WHERE (titulo LIKE '%aya%')
---
  def buscar_nome
	@jogos = Jogo.where(["titulo LIKE ?", "%#{params[:titulo]}%"])

SELECT  "jogos".* FROM "jogos" WHERE "jogos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def add_jogada
	@jogo = Jogo.find(params[:id])

SELECT  "jogos".* FROM "jogos" WHERE "jogos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_jogo
      @jogo = Jogo.find(params[:id])