app/controllers/sessions_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."username" = ? LIMIT ?  [["username", "aaaaaa"], ["LIMIT", 1]]
---
  def create
    @usuarios = Usuario.all
    respond_to do |format|
      usuario = @usuarios.find_by(username: params[:session][:username].downcase)