app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params.except(:imagem_upload))
    @usuario.definir_imagem_perfil(usuario_params[:imagem_upload],0)
    @checkUsername = Usuario.find_by(username:usuario_params[:username])
    if(@checkUsername.blank?)
      respond_to do |format|
        if @usuario.save
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "usuarios" ("nome", "email", "username", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "MyString"], ["email", "MyString"], ["username", "MyString"], ["senha", "MyString"], ["created_at", "2017-09-08 01:14:59.579731"], ["updated_at", "2017-09-08 01:14:59.579731"]]

  def update
    @usuario.definir_imagem_perfil(usuario_params[:imagem_upload],1)
    respond_to do |format|
      if @usuario.update(usuario_params.except(:imagem_upload))
---
UPDATE "usuarios" SET "username" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["username", "MatDoido"], ["updated_at", "2017-10-28 17:38:38.510685"], ["id", 3]]

  def destroy
    @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 980190962]]

  def mostrarResultados
    @usuarios = Usuario.where(["username LIKE ?", "%#{params[:username]}%"])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."username" IS NULL LIMIT ?  [["LIMIT", 1]]